{
  "questions": [
    "What was the company’s operating income in [year]?",
    "What was the company’s gross profit in [year]?",
    "What was the company's earnings per share (EPS) in [year]?",
    "What was the company’s cash flow from operating activities in [year]?",
    "What were the company’s capital expenditures in [year]?",
    "What was the company's total liabilities in [year]?",
    "What were the company's total assets in [year]?",
    "Did the company issue or repurchase stock in [year]?",
    "How much did the company spend on marketing or sales in [year]?",
    "What is the fiscal year-end date for the company?",
    "Which company had the highest total net sales in a given year?",
    "What is the average total net sales of technology sector companies in a given year?",
    "How has [Company]'s net income changed over the last 5 years?",
    "What is the year-over-year growth rate in revenue for [Company]?",
    "Which company had the largest drop in net income between any two consecutive years?",
    "Which company had the highest average revenue over the past 3 years?",
    "Which companies consistently outperformed the average revenue across all companies for the same year?",
    "Is [Company]’s revenue growth rate above or below the industry average over the past 3 years?",
    "Which companies show the strongest correlation between marketing expenses and revenue over time?",
    "Based on 3-year trends, what companies are outperforming peers in terms of both growth and margin improvement?",
    "How has [Company]'s efficiency changed over time in converting assets into revenue (Asset Turnover Ratio)?",
    "Which companies had higher total net sales than a given company in a given year?",
    "Which companies had a consistent increase in total net sales over 3 consecutive years?",
    "Which company had the most volatile total net sales over time?",
    "What will be [Company]’s projected net income for next year(s)?",
    "Predict which companies are likely to report a decline in net income next year.",
    "When is [Company] likely to surpass $X in annual revenue?",
    "Can we predict a company’s future capital expenditures based on revenue growth and past investment behavior?",
    "How long will it take for a company to double its revenue?",
    "When will a company's liabilities exceed its assets (if ever)?",
    "What are the primary revenue streams for the company, and how have they evolved over the past three years?",
    "How diversified is the company's customer base according to the latest 10-K?",
    "Identify the main competitors mentioned in the 10-K and explain the competitive landscape.",
    "How does the company describe its growth strategy and future objectives?",
    "What major risks or uncertainties did the company highlight?",
    "Does the company face any notable regulatory challenges?",
    "What is the trend of the company's net income over the last three fiscal years?",
    "How does the company's EBITDA margin compare with the industry average?",
    "Describe any unusual or significant changes in operating expenses highlighted in the 10-K.",
    "Based on current financials and market conditions, what insights can be derived about the company's valuation?",
    "What major capital expenditures did the company undertake, and what could be their long-term impacts?",
    "Can you identify and discuss the company’s current dividend policy or share repurchase strategies?",
    "How effective has the company been at managing inventory and accounts receivable compared to peers?",
    "Are there any management changes or board restructuring plans mentioned, and what could be their impact?",
    "Did the company experience disruptions in its supply chain, and how does this compare to the broader industry situation?",
    "What ESG initiatives or sustainability practices has the company emphasized in the 10-K?",
    "Has the company faced any ESG-related controversies or litigations recently?",
    "Describe how the company's governance structure aligns with best practices within its industry.",
    "What is the company's current debt-to-equity ratio, and how sustainable is its debt level?",
    "Has the company recently refinanced or restructured its debt, and if so, what are the implications?",
    "How have recent technological advancements in the industry affected the company's operations?",
    "Does the company explicitly mention emerging industry trends or technologies they're investing in?",
    "What significant patents or intellectual property assets does the company hold?",
    "Describe the company's investment in R&D compared to industry benchmarks.",
    "How does the company position its brand in the marketplace, based on information from the 10-K and broader market knowledge?",
    "Did the company undergo any rebranding or significant marketing shifts?",
    "How sensitive is the company to macroeconomic conditions, such as inflation, interest rate changes, or currency fluctuations?",
    "Has the company described any direct impacts from global geopolitical events or economic shifts?",
    "Based on current financials and market conditions, what are plausible growth scenarios for the company over the next three years?",
    "What forward-looking statements or future commitments did the company emphasize, and how realistic are these in the context of current market conditions?"
  ]
}
